# SQLAlchemy

## Reading Data

### Using SQLAlchemy

In [1]:
from sqlalchemy import create_engine, text
import pandas as pd   
#import sqlalchemy as sqlalchemy

In [2]:
con_str = "postgresql+psycopg2://postgres:1223@localhost:5432/textbookdb"
engine = create_engine(con_str)

In [14]:
query = """
    select *
    from customers
    limit 3
"""

with engine.connect() as conn:
    result = conn.execute(
        text(query)
    )

    rows = result.fetchall()

for row in rows:
    print(row.customer_id, row.first_name)

1 Arlena
2 Ode
3 Braden

In [18]:
query = """
    select *
    from customers
    where customer_id < {} and first_name like '{}%'
    limit 4
""".format(50, 'A')

with engine.connect() as conn:
    result = conn.execute(
        text(query)
    )

    rows = result.fetchall()

for row in rows:
    print(row.customer_id, row.first_name)

1 Arlena
27 Anson
29 Ashia

In [22]:
query = """
    select *
    from customers
    where customer_id < {id} and first_name like '{begins}%'
    limit 4
""".format(id = 50, begins = 'A')

with engine.connect() as conn:
    result = conn.execute(
        text(query)
    )

    rows = result.fetchall()

for row in rows:
    print(row.customer_id, row.first_name)

1 Arlena
27 Anson
29 Ashia

In [27]:
query = """
    select *
    from customers
    where customer_id < :id and first_name like :begins
    limit 4
"""

with engine.connect() as conn:
    result = conn.execute(
        text(query), {'id' : 50, 'begins' : 'A%'}
    )

    rows = result.fetchall()

for row in rows:
    print(row.customer_id, row.first_name)

1 Arlena
27 Anson
29 Ashia

In [30]:
query = """
    select *
    from customers
    where customer_id in :id
   
"""

with engine.connect() as conn:
    result = conn.execute(
        text(query), {'id' : (50,1,2,3)}
    )

    rows = result.fetchall()

for row in rows:
    print(row.customer_id, row.first_name)

1 Arlena
2 Ode
3 Braden
50 Tucker

### Using pd.read_sql

In [4]:
con_str = "postgresql+psycopg2://postgres:1223@localhost:5432/textbookdb"
engine = create_engine(con_str)

query = """
    select *
    from customers
    limit 3
"""   

df = pd.read_sql(query, con = engine
                )
df

,customer_id,title,first_name,last_name,suffix,email,gender,ip_address,phone,street_address,city,state,postal_code,latitude,longitude,date_added
0,1,None,Arlena,Riveles,None,ariveles0@stumbleupon.com,F,98.36.172.246,None,None,None,None,None,NaN,NaN,2017-04-23
1,2,Dr,Ode,Stovin,None,ostovin1@npr.org,M,16.97.59.186,314-534-4361,2573 Fordem Parkway,Saint Louis,MO,63116,38.5814,-90.2625,2014-10-02
2,3,None,Braden,Jordan,None,bjordan2@geocities.com,M,192.86.248.59,None,5651 Kennedy Park,Pensacola,FL,32590,30.6143,-87.2758,2018-10-27

In [5]:
con_str = "postgresql+psycopg2://postgres:12231@localhost:5432/textbookdb"
engine = create_engine(con_str)

query = """
    select *
    from customers
    where customer_id in %(id)s
    limit 3
"""   

df = pd.read_sql(query, con = engine, params = {'id': (1,2,40)}
                )
df

,customer_id,title,first_name,last_name,suffix,email,gender,ip_address,phone,street_address,city,state,postal_code,latitude,longitude,date_added
0,1,None,Arlena,Riveles,None,ariveles0@stumbleupon.com,F,98.36.172.246,None,None,None,None,None,NaN,NaN,2017-04-23
1,2,Dr,Ode,Stovin,None,ostovin1@npr.org,M,16.97.59.186,314-534-4361,2573 Fordem Parkway,Saint Louis,MO,63116,38.5814,-90.2625,2014-10-02
2,40,None,Dee,Boulsher,None,dboulsher13@youtu.be,F,196.245.126.5,615-619-5880,61458 Meadow Vale Point,Nashville,TN,37205,36.1114,-86.8690,2013-11-25

## Loading Data

In [8]:
query = text("""
CREATE TABLE IF NOT EXISTS trial.customers_new AS
SELECT customer_id, first_name, last_name
FROM public.customers
WHERE customer_id < :max_id
""")

with engine.begin() as conn:
    conn.execute(text("CREATE SCHEMA IF NOT EXISTS trial"))

with engine.begin() as conn:
    conn.execute(query, {"max_id": 5})

In [9]:
query = text("""
insert into trial.customers_new (customer_id, first_name, last_name)
SELECT customer_id, first_name, last_name
FROM public.customers
WHERE customer_id < :max_id and customer_id > :min_id
""")

with engine.begin() as conn:
    conn.execute(query, {"max_id": 8, 'min_id': 5})

In [14]:
df[['customer_id', 'first_name', 'last_name']].to_sql(
    name="customers_new",
    con=engine,
    schema="trial",  
    if_exists="append",
    index=False
)

3